Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This guide has shown how to use SmallRye Stork to discover and select your services. You can find more about Stork in:
ja_jp: このガイドでは、SmallRye Storkを使ってサービスを発見し、選択する方法を紹介しました。Storkについては、以下のページで詳しく紹介しています:

source: This guide has shown how you can build stream processing applications using Quarkus and the Kafka Streams APIs, both in JVM and native modes. For running your KStreams application in production, you could also add health checks and metrics for the data pipeline. Refer to the Quarkus guides on xref:micrometer.adoc[Micrometer], xref:smallrye-metrics.adoc[SmallRye Metrics], and xref:smallrye-health.adoc[SmallRye Health] to learn more.
ja_jp: このガイドでは、QuarkusとKafka Streams APIを使って、JVMモードとネイティブモードの両方でストリーム処理アプリケーションを構築する方法を紹介しました。KStreamsアプリケーションを本番環境で実行するために、データパイプラインのヘルスチェックやメトリクスを追加することもできます。詳細は、 link:micrometer.html[Micrometer]、 link:smallrye-metrics.html[SmallRye Metrics]、 link:smallrye-health.html[SmallRye Health]に関するQuarkusのガイドを参照してください。

source: This guide has shown how you can build stream processing applications using Quarkus and the Kafka Streams APIs, both in JVM and native modes. For running your KStreams application in production, you could also add health checks and metrics for the data pipeline. Refer to the Quarkus guides on xref:telemetry-micrometer.adoc[Micrometer], and xref:smallrye-health.adoc[SmallRye Health] to learn more.
ja_jp: このガイドでは、Quarkus と Kafka Streams API を使用して、JVM モードとネイティブモードの両方でストリーム処理アプリケーションを構築する方法を示しました。KStreams アプリケーションを本番環境で実行するために、データパイプラインのヘルスチェックとメトリクスを追加することもできます。詳細については、xref:telemetry-micrometer.adoc[Micrometer] および xref:smallrye-health.adoc[SmallRye Health] に関する Quarkus ガイドを参照してください。

source: This guide has shown how you can build stream processing applications using Quarkus and the Kafka Streams APIs, both in JVM and native modes. For running your KStreams application in production, you could also add health checks and metrics for the data pipeline. Refer to the Quarkus guides on xref:telemetry-micrometer.adoc[Micrometer], xref:smallrye-metrics.adoc[SmallRye Metrics], and xref:smallrye-health.adoc[SmallRye Health] to learn more.
ja_jp: このガイドでは、QuarkusとKafka Streams APIを使用して、JVMモードとネイティブモードの両方でストリーム処理アプリケーションを構築する方法を紹介しました。KStreamsアプリケーションを本番環境で実行するために、データパイプラインのヘルスチェックとメトリクスを追加することもできます。詳細は、Quarkusの xref:telemetry-micrometer.adoc[Micrometer] 、xref:smallrye-metrics.adoc[SmallRye Metrics] 、 xref:smallrye-health.adoc[SmallRye Health] のガイドを参照してください。

source: This guide has shown how you can interact with AMQP 1.0 using Quarkus. It utilizes https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging] to build data streaming applications.
ja_jp: このガイドでは、Quarkus を使用して AMQP 1.0 とやりとりする方法を示しました。 https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging] を使用して、データストリーミングアプリケーションを構築します。

source: This guide has shown how you can interact with Kafka using Quarkus. It utilizes Quarkus Messaging to build data streaming applications.
ja_jp: このガイドでは、Quarkus を使用して Kafka と対話する方法を説明しました。 Quarkus Messaging を活用して、データストリーミングアプリケーションを構築します。

source: This guide has shown how you can interact with Kafka using Quarkus. It utilizes SmallRye Reactive Messaging to build data streaming applications.
ja_jp: このガイドでは、Quarkus を使用して Kafka とやりとりする方法を示しました。SmallRye Reactive Messaging を利用して、データストリーミングアプリケーションを構築します。

source: This guide has shown how you can interact with Kafka using Quarkus. It utilizes https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging] to build data streaming applications.
ja_jp: このガイドでは、Quarkus を使用して Kafka とやりとりする方法を示しました。 https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging] を利用して、データストリーミングアプリケーションを構築します。

source: This guide has shown how you can interact with Pulsar using Quarkus. It utilizes Quarkus Messaging to build data streaming applications.
ja_jp: このガイドでは、Quarkus を使用して Pulsar と対話する方法を説明しました。 Quarkus は、Quarkus Messaging を利用してデータストリーミングアプリケーションを構築します。

source: This guide has shown how you can interact with Pulsar using Quarkus. It utilizes https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging] to build data streaming applications.
ja_jp: このガイドでは、Quarkus を使用して Pulsar とやりとりする方法を示しました。 https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging] を利用して、データストリーミングアプリケーションを構築します。

source: This guide has shown how you can interact with RabbitMQ using Quarkus. It utilizes https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging] to build data streaming applications.
ja_jp: このガイドでは、Quarkusを使ってRabbitMQと対話する方法を紹介しました。 https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging]を利用して、データストリーミングアプリケーションを構築しています。

source: This guide has the following requirements:
ja_jp: このガイドには、次の要件があります。

source: This guide helps you:
ja_jp: このガイドは以下についてサポートします：

source: This guide introduced how you can use Vert.x APIs from a Quarkus application. It's just a brief overview. If you want to know more, check the xref:vertx-reference.adoc[reference guide about Vert.x in Quarkus].
ja_jp: このガイドでは、QuarkusアプリケーションからVert.x APIを使用する方法を紹介しました。 あくまで簡単な概要です。 もっと詳しく知りたい場合は、 xref:vertx-reference.adoc[QuarkusのVert.xに関するリファレンスガイド] をご覧ください。

source: This guide is a brief introduction to some reactive features offered by Quarkus. Quarkus is a reactive framework, and so offers a lot of reactive features.
ja_jp: このガイドでは、Quarkusが提供するいくつかのリアクティブ機能を簡単に紹介しました。Quarkusはリアクティブフレームワークであるため、多くのリアクティブ機能を提供しています。

source: This guide is a collection of tips to help you solve the problems you encounter when compiling applications to native executable.
ja_jp: このガイドは、アプリケーションをネイティブ実行可能ファイルにコンパイルする際に遭遇する問題を解決するためのヒントをまとめたものです。

source: This guide is a companion to the xref:building-native-image.adoc[Building a Native Executable], xref:native-and-ssl.adoc[Using SSL With Native Images], and xref:writing-native-applications-tips.adoc[Writing Native Applications], guides. It explores advanced topics that help users diagnose issues, increase the reliability and improve the runtime performance of native executables. These are the high level sections to be found in this guide:
ja_jp: このガイドは、xref:building-native-image.adoc[ネイティブ実行可能ファイルのビルド]、xref:native-and-ssl.adoc[ネイティブイメージでのSSLの使用]、xref:writing-native-applications-tips.adoc[ネイティブアプリケーションの作成] の各ガイドに付随するものです。ユーザーが問題を診断し、信頼性を高め、ネイティブ実行可能ファイルのランタイム パフォーマンスを向上させるのに役立つ高度なトピックについて説明します。 これらは、このガイドにある高レベルのセクションです:

source: This guide is a companion to the xref:building-native-image.adoc[Building a Native Executable], xref:native-and-ssl.adoc[Using SSL With Native Images], and xref:writing-native-applications-tips.adoc[Writing Native Applications], guides. It provides further details to debugging issues in Quarkus native executables that might arise during development or production.
ja_jp: このガイドは、 link:building-native-image.html[ネイティブ実行可能ファイルのビルド]、 link:native-and-ssl.html[Using SSL With Native Images[ネイティブイメージでのSSLの使用]、 link:writing-native-applications-tips.html[ネイティブアプリケーションの作成]の各ガイドに付随するものです。このガイドでは、開発時や本番時に発生する可能性のあるQuarkusのネイティブ実行可能ファイルの問題をデバッグするための詳細を説明しています。

source: This guide is a companion to the Building a Native Executable, Using SSL With Native Images, and Writing Native Applications, guides.
ja_jp: このガイドは、ネイティブ実行可能ファイルのビルド、ネイティブイメージでのSSLの使用、ネイティブアプリケーションの作成の各ガイドの対となるものです。

source: This guide is about https://resteasy.dev[RESTEasy Classic] which used to be the default JAX-RS implementation until Quarkus 2.8.
ja_jp: このガイドは、 Quarkus 2.8 までデフォルトの JAX-RS 実装として使用されていた https://resteasy.dev[RESTEasy Classic] についてのガイドです。

source: This guide is about https://resteasy.dev[RESTEasy Classic] which used to be the default Jakarta REST (formerly known as JAX-RS) implementation until Quarkus 2.8.
ja_jp: このガイドは、Quarkus 2.8までデフォルトのJakarta REST（旧称JAX-RS）実装であった link:https://resteasy.dev[RESTEasy Classic] についてのものです。

source: This guide is about https://resteasy.dev[RESTEasy Classic], which used to be the default Jakarta REST (formerly known as JAX-RS) implementation until Quarkus 2.8.
ja_jp: このガイドは、Quarkus 2.8 までデフォルトの Jakarta REST (旧称 JAX-RS) 実装であった https://resteasy.dev[RESTEasy Classic] に関するものです。

source: This guide is about the REST Client compatible with https://resteasy.dev[RESTEasy Classic] which used to be the default JAX-RS implementation until Quarkus 2.8.
ja_jp: このガイドは、 Quarkus 2.8 までデフォルトの JAX-RS 実装であった link:https://resteasy.dev[RESTEasy Classic]と互換性のある REST Client に関するものです。

source: This guide is about the REST Client compatible with https://resteasy.dev[RESTEasy Classic] which used to be the default Jakarta REST (formerly known as JAX-RS) implementation until Quarkus 2.8.
ja_jp: このガイドは、Quarkus 2.8までデフォルトのJakarta REST（旧称JAX-RS）実装であった link:https://resteasy.dev[RESTEasy Classic] と互換性のあるREST Clientに関するものです。

source: This guide is about the multipart support of the REST Client compatible with https://resteasy.dev[RESTEasy Classic] which used to be the default JAX-RS implementation until Quarkus 2.8.
ja_jp: このガイドでは、Quarkus 2.8までデフォルトのJAX-RS実装であった https://resteasy.dev[RESTEasy Classic]と互換性のあるRESTクライアントのマルチパートサポートについて説明します。

source: This guide is about the multipart support of the REST Client compatible with https://resteasy.dev[RESTEasy Classic] which used to be the default Jakarta REST (formerly known as JAX-RS) implementation until Quarkus 2.8.
ja_jp: このガイドは、Quarkus 2.8までデフォルトのJakarta REST（旧JAX-RS）実装であった link:https://resteasy.dev[RESTEasy Classic] 互換のREST Clientのマルチパート対応に関するものです。

source: This guide is based on the REST client guide so you should get this Maven project first.
ja_jp: このガイドはRESTクライアントガイドに基づいているので、最初にこのMavenプロジェクトを取得する必要があります:

source: This guide is based on the REST client guide, so you should get this Maven project first.
ja_jp: このガイドはRESTクライアントガイドに基づいているので、最初にこのMavenプロジェクトを取得する必要があります。

source: This guide is mainly about datasource configuration. If you want more details about how to consume and make use of a reactive datasource, please refer to the xref:reactive-sql-clients.adoc[Reactive SQL clients guide].
ja_jp: このガイドでは、主にデータソースの設定について説明します。リアクティブデータソースの利用方法の詳細を知りたい場合は、 link:reactive-sql-clients.html[リアクティブ SQL クライアントのガイド]を参照してください。

source: This guide is not an in-depth article about what _Reactive_ is and how Quarkus enables reactive architectures. If you want to read more about these topics, refer to the xref:quarkus-reactive-architecture.adoc[Reactive Architecture guide], which provides an overview of the Quarkus reactive ecosystem.
ja_jp: このガイドは、 _リアクティブ_ とは何か、Quarkusでどのようにリアクティブアーキテクチャを実現するかについての詳細な記事ではありません。これらのトピックについて詳しく知りたい場合は、Quarkusのリアクティブエコシステムの概要を説明した xref:quarkus-reactive-architecture.adoc[リアクティブアーキテクチャガイド] を参照してください。

source: This guide is not going to go into the specifics of using either xref:hibernate-orm.adoc[Hibernate], or its underlying link:{jakarta-persistence-spec-url}[Jakarta Persistence specification], because both already have great documentation that you can and should use for more in-depth knowledge.
ja_jp: このガイドでは、 xref:hibernate-orm.adoc[Hibernate] またはその基盤となる link:{jakarta-persistence-spec-url}[Jakarta Persistence 仕様] のどちらかの具体的な使用法については詳しく説明しません。なぜなら、どちらもすでに優れたドキュメントがあり、より深い知識を得るために活用できるからです。

source: This guide is the companion from the Getting Started with AMQP 1.0.
ja_jp: このガイドは、AMQP 1.0入門の対です。

source: This guide is the companion from the Getting Started with RabbitMQ.
ja_jp: このガイドは、RabbitMQ入門ガイドの対です。

source: This guide is the companion from the Stork Getting Started Guide.
ja_jp: このガイドは、Stork 入門ガイドの対です。

source: This guide is the companion from the xref:amqp.adoc[Getting Started with AMQP 1.0]. It explains in more details the configuration and usage of the AMQP connector for reactive messaging.
ja_jp: このガイドは、xref:amqp.adoc[AMQP 1.0 スタートガイド] のドキュメントです。リアクティブメッセージング用の AMQP コネクターの設定と使用法について詳しく説明します。

source: This guide is the companion from the xref:mailer.adoc[Mailer Getting Started Guide]. It explains in more details the configuration and usage of the Quarkus Mailer.
ja_jp: このガイドは、 link:mailer.html[Mailer 入門ガイド]の続編です。このガイドでは、Quarkus Mailerの設定と使用方法について詳しく説明しています。

source: This guide is the companion from the xref:rabbitmq.adoc[Getting Started with RabbitMQ]. It explains in more details the configuration and usage of the RabbitMQ connector for reactive messaging.
ja_jp: このガイドは、 xref:rabbitmq.adoc[RabbitMQ スタートガイド] のドキュメントです。リアクティブメッセージング用 RabbitMQ コネクターの設定と使い方について詳しく説明します。

source: This guide is the companion from the xref:stork.adoc[Stork Getting Started Guide]. It explains the configuration and usage of SmallRye Stork integration in Quarkus.
ja_jp: このガイドは、 link:stork.html[Stork 入門ガイド]と対です。QuarkusでのSmallRye Stork統合の設定と使用方法について説明しています。

source: This guide is the companion to the xref:vertx.adoc[Using Eclipse Vert.x API from a Quarkus Application] guide. It provides more advanced details about the usage and the configuration of the Vert.x instance used by Quarkus.
ja_jp: このガイドは、 link:vertx.html[QuarkusアプリケーションからEclipse Vert.x APIの使用] ガイドの姉妹編です。Quarkusで使用されるVert.xインスタンスの使用方法や設定について、より詳細に説明しています。

source: This guide is the entry point for everything security in Quarkus.
ja_jp: このガイドは、Quarkusのすべてのセキュリティに関するエントリーポイントです。

source: This guide only covered an easy use case, the extension offers multiple datasources, multiple principal queries configuration as well as a bcrypt password mapper.
ja_jp: このガイドでは、簡単な使用例のみを取り上げていますが、このエクステンションは複数のデータソース、複数のプリンシパルクエリの設定、および bcrypt パスワードマッパーを提供しています。

source: This guide presents how you can build a Quarkus application using:
ja_jp: このガイドでは、Quarkusのアプリケーションで次を使って構築する方法を紹介します。

source: This guide presents what build analytics is and how to configure it.
ja_jp: このガイドでは、ビルド分析とは何か、どのように設定するかを紹介します。

source: This guide provides a crosscutting explanation of the OpenTelemetry extension and how to use it. If you need details about any particular signal (tracing or metrics), please refer to the signal specific guide.
ja_jp: このガイドでは、OpenTelemetry エクステンションとその使用方法について、横断的に説明します。特定のシグナル (トレースまたはメトリクス) の詳細が必要な場合は、シグナル固有のガイドを参照してください。

source: This guide provides an in-depth look on Apache Kafka and SmallRye Reactive Messaging framework. For a quick start take a look at xref:kafka-getting-started.adoc[Getting Started to Quarkus Messaging with Apache Kafka].
ja_jp: このガイドでは、Apache Kafka と SmallRye Reactive Messaging フレームワークについて詳しく説明します。 クイックスタートについては、xref:kafka-getting-started.adoc[Apache Kafka を使用した Quarkus Messaging 入門] を参照してください。

source: This guide provides an in-depth look on Apache Kafka and SmallRye Reactive Messaging framework. For a quick start take a look at xref:kafka-reactive-getting-started.adoc[Getting Started to SmallRye Reactive Messaging with Apache Kafka].
ja_jp: このガイドでは、Apache Kafka および SmallRye Reactive Messaging フレームワークについて詳しく説明します。クイックスタートについては、xref:kafka-reactive-getting-started.adoc[Apache Kafka を使用した SmallRye Reactive Messaging の概要] を参照してください。

source: This guide provides an in-depth look on Apache Pulsar and SmallRye Reactive Messaging framework. For a quick start take a look at xref:pulsar-getting-started.adoc[Getting Started to Quarkus Messaging with Apache Pulsar].
ja_jp: このガイドでは、Apache Pulsar と SmallRye Reactive Messaging フレームワークについて詳しく説明します。 クイックスタートについては、xref:pulsar-getting-started.adoc[Apache Pulsar を使用した Quarkus Messaging の概要] を参照してください。

source: This guide shows how you can use virtual threads with Quarkus REST and the REST client. Learn more about virtual threads support on:
ja_jp: このガイドでは、Quarkus RESTとRESTクライアントで仮想スレッドを使用する方法を説明しました。 仮想スレッドのサポートについては、こちらを参照してください：

source: This guide shows how your Quarkus application can use Apache Kafka, http://avro.apache.org/docs/current/[Avro] serialized records, and connect to a schema registry (such as the https://docs.confluent.io/platform/current/schema-registry/index.html[Confluent Schema Registry] or https://www.apicur.io/registry/[Apicurio Registry].
ja_jp: このガイドでは、QuarkusアプリケーションでApache Kafka、 link:http://avro.apache.org/docs/current/[Avro] シリアライズレコードを使用し、スキーマレジストリ（ link:https://docs.confluent.io/platform/current/schema-registry/index.html[Confluent Schema Registry] か link:https://www.apicur.io/registry/[Apicurio Registry] ）に接続する方法を示します。

source: This guide shows how your Quarkus application can use Apache Kafka, https://avro.apache.org/docs/current/[Avro] serialized records, and connect to a schema registry (such as the https://docs.confluent.io/platform/current/schema-registry/index.html[Confluent Schema Registry] or https://www.apicur.io/registry/[Apicurio Registry]).
ja_jp: このガイドでは、Quarkus アプリケーションが Apache Kafka、 https://avro.apache.org/docs/current/[Avro] でシリアライズされたレコードを使用し、スキーマレジストリー (https://docs.confluent.io/platform/current/schema-registry/index.html[Confluent スキーマレジストリー] または https://www.apicur.io/registry/[Apicurio レジストリー]) に接続する方法を説明しています。

source: This guide shows how your Quarkus application can use Apache Kafka, https://json-schema.org/[JSON Schema] serialized records, and connect to a schema registry (such as the https://docs.confluent.io/platform/current/schema-registry/index.html[Confluent Schema Registry] or https://www.apicur.io/registry/[Apicurio Registry]).
ja_jp: このガイドでは、Quarkus アプリケーションで Apache Kafka、https://json-schema.org/[JSON スキーマ] でシリアライズされたレコードを使用し、スキーマレジストリー (https://docs.confluent.io/platform/current/schema-registry/index.html[Confluent Schema Registry] や https://www.apicur.io/registry/[Apicurio Registry] など) に接続する方法を説明します。

source: This guide shows the general principles of Quarkus Messaging extensions.
ja_jp: このガイドでは、Quarkus Messaging エクステンションの一般的な原則について説明します。

source: This guide takes as input the application developed in the xref:getting-started.adoc[Getting Started Guide].
ja_jp: このガイドは、xref:getting-started.adoc[入門ガイド] で開発されたアプリケーションを入力としています。

source: This guide uses Micrometer, so the above dependencies are already included in this guide's pom.xml.
ja_jp: このガイドでは Micrometer を使用しているため、上記の依存関係はこのガイドの pom.xml にすでに含まれています。

source: This guide uses the Mutiny API. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive, reactive programming library].
ja_jp: このガイドでは、Mutiny APIを使用しています。Mutinyに慣れていない方は、 link:mutiny-primer.html[Mutiny - 直感的なリアクティブプログラミングライブラリ]をご覧ください。

source: This guide uses the `quarkus-websockets-next` extension. This extension is a new implementation of the WebSocket API that is more efficient and easier to use than the original `quarkus-websockets` extension. The original `quarkus-websockets` extension is still available and will continue to be supported.
ja_jp: このガイドでは、`quarkus-websockets-next` エクステンションを使用します。 このエクステンションは、WebSocket API の新しい実装であり、元の `quarkus-websockets` エクステンションよりも効率的で使いやすいものとなっています。元の `quarkus-websockets` エクステンションは今後も利用可能で、引き続きサポートされます。

source: This guide utilizes the `quarkus-websockets-next` extension, an implementation of the WebSocket API boasting enhanced efficiency and usability compared to the legacy `quarkus-websockets` extension. The original `quarkus-websockets` extension remains accessible, will receive ongoing support, but it's unlikely to receive to feature development.
ja_jp: このガイドでは、従来の `quarkus-websockets` エクステンションに比べ、効率性と使いやすさが向上した WebSocket API の実装である `quarkus-websockets-next` エクステンションを利用します。 オリジナルの `quarkus-websockets` エクステンションは引き続きアクセス可能で、継続的なサポートが提供されますが、機能開発が行われる可能性は低いです。

source: This guide walks you through generating a sample project followed by creating multiple functions showing how to implement `HttpFunction`, `BackgroundFunction` and `RawBackgroundFunction` in Quarkus. Once built, you will be able to deploy the project to Google Cloud.
ja_jp: このガイドでは、サンプルプロジェクトを生成し、Quarkusで `HttpFunction` 、 `BackgroundFunction` 、 `RawBackgroundFunction` を実装する方法を説明します。ビルド後は、プロジェクトをGoogle Cloudにデプロイすることができます。

source: This guide walks you through generating a sample project followed by creating three HTTP endpoints written with JAX-RS APIs, Servlet APIs, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] APIs. Once built, you will be able to deploy the project to Google Cloud.
ja_jp: このガイドでは、サンプルプロジェクトを生成し、JAX-RS API、Servlet API、Reactive Routes、または link:funqy-http.html[Funqy HTTP] APIで記述された3つのHTTPエンドポイントを作成する手順を説明します。構築後は、プロジェクトをGoogle Cloudにデプロイします。

source: This guide walks you through generating a sample project followed by creating three HTTP endpoints written with Jakarta REST APIs, Servlet APIs, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] APIs. Once built, you will be able to deploy the project to Google Cloud.
ja_jp: このガイドでは、サンプルプロジェクトを生成し、Jakarta REST API、Servlet API、Reactive Routes、またはxref:funqy-http.adoc[Funqy HTTP] APIで書かれた3つのHTTPエンドポイントを作成する方法を説明します。ビルドが完了したら、プロジェクトをGoogle Cloudにデプロイすることができるようになります。

source: This guide walks you through generating an example Java project via a Maven archetype. Later on it walks through the structure of the project so you can adapt any existing projects you have to use Amazon Lambda.
ja_jp: このガイドでは、Maven のアーキタイプを介して Java プロジェクトのサンプルを生成する方法を説明します。その後、既存のプロジェクトを Amazon Lambda で利用できるようにするために、プロジェクトの構造を説明します。

source: This guide walks you through generating an example Java project via a Maven archetype. Later on, it walks through the structure of the project so you can adapt any existing projects you have to use AWS Lambda.
ja_jp: このガイドでは、Maven アーキタイプを使用してサンプル Java プロジェクトを生成する手順を説明します。その後、プロジェクトの構造について説明しているため、 既存のプロジェクトを AWS Lambda を使用するように適応させることができます。

source: This guide walks you through generating an example Java project via a Maven archetype. Later on, it walks through the structure of the project so you can adapt any existing projects you have to use Amazon Lambda.
ja_jp: このガイドでは、Maven のアーキタイプを利用して Java プロジェクトのサンプルを生成する方法を説明します。その後、既存のプロジェクトを Amazon Lambda で利用できるようにするために、プロジェクトの構造を説明します。

source: This guide walks you through generating an example Java project via a maven archetype and deploying it to AWS.
ja_jp: このガイドでは、mavenのArchetypeを使用してJavaプロジェクトのサンプルを生成し、AWSにデプロイする方法を説明します。

source: This guide walks you through running a Maven Archetype to generate a sample project that contains three http endpoints written with JAX-RS APIs, Servlet APIs, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] APIs. After building, you will then be able to deploy to Azure.
ja_jp: このガイドでは、JAX-RS API、Servlet API、Vert.x Web、または link:funqy-http[Funqy HTTP] APIで記述された3つのHTTPエンドポイントを含むサンプルプロジェクトを生成するために、Maven Archetype のウォークスルーを行います。ビルド後、Azureにデプロイできるようになります。

source: This guide walks you through running a Maven project that can deploy an HTTP Trigger Azure Function class. This function class injects a CDI bean service that generates a greeting message that is passed back to the client.
ja_jp: このガイドでは、HTTP Trigger Azure Function クラスをデプロイできる Maven プロジェクトの実行方法を説明します。この関数クラスは、クライアントに返される挨拶メッセージを生成する CDI Bean サービスを注入します。

source: This guide walks you through running a maven project that can deploy a Quarkus REST endpoint to Azure Functions. While only Jakarta REST is provided as an example, you can easily replace it with the HTTP framework of your choice.
ja_jp: このガイドでは、Quarkus REST エンドポイントを Azure Functions にデプロイできる maven プロジェクトの実行について説明します。 その例として Jakarta REST が示されていますが、これは簡単に任意の HTTPフレームワークに置き換えることができます。

source: This guide walks you through running a maven project that can deploy a Resteasy Reactive endpoint to Azure Functions. While only Jakarta REST is provided as an example, you can easily replace it with the HTTP framework of your choice.
ja_jp: このガイドでは、RESTEasy ReactiveエンドポイントをAzure Functionsにデプロイすることができるmavenプロジェクトの実行を説明します。例としてJakarta RESTのみが提供されていますが、お好みのHTTPフレームワークで簡単に置き換えることができます。

source: This guide walks you through running a maven project that can deploy an Http Trigger Azure Function class. This function class injects a CDI bean service that generates a greeting message that is passed back to the client.
ja_jp: このガイドでは、Http Trigger Azure Function クラスをデプロイできる Maven プロジェクトの実行方法について説明します。 この関数クラスは、クライアントに返される挨拶メッセージを生成する CDI Bean サービス を注入します。
